# vsoGetEventInfo

## Description
Gets the complete message information associated with an object event.

```pascal
PROCEDURE vsoGetEventInfo(
				VAR outObjEvent  : LONGINT;
				VAR outEventData : LONGINT);
```

```python

def vs.vsoGetEventInfo():
    return (outObjEvent, outEventData)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outObjEvent|LONGINT||
|outEventData|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events